report/report.tex

\subsection{AST}
\label{sec:orgfff26ab}
The implementation of the abstract syntax tree is almost true to the Grammar presented in \ref{grammar}. There are however three minor changes. Instead of rules looking like
\begin{verbatim}
data Rules = P Pattern [Def] Pattern
          | R Rules Rules
\end{verbatim}
it simply will be a product type of the constructor Rule, and then the Func sum type will take a list of rules, as such:
\begin{verbatim}
data Func = Func ID [Rules]

data Rule = Rule { args :: Pattern, body :: [Def], output :: Pattern }
\end{verbatim}
This change is mainly reasoned by being easier to parse and evaluate. the meaning should not change.
For the same reason we introduce another pattern namely a NilNil, essentially this is a constant value, however, NilNil as a legal value in RIL depends on the build procedure that will create it. We, therefore, want it to have its own constructor as this simply makes implementation easier.
Lastly, we earlier described the usefulness of having two ways of creating pairs, in the AST, we however only have one constructor for these as we can use some build-in functionality of megaparsec to enforce precedence without rewriting our grammar.
\subsection{Parsers}
\label{sec:org2ce1cd5}
\subsubsection{Basics.}
\label{sec:org762656c}
Comments are based on f\#. line-comments is the same as in // and block-comments is (* *). Identifiers can be any string starting with a lower character followed by any alphanumerical character, a dash, or an underscore.\footnote{any code described the following subsections can be found in appendix ?? or in the file Parser.hs}

\subsubsection{Functions}
\label{sec:org18bf185}
As described ARL has been chosen to have some strict indentation rules. This is forced to make the code readable. We must thus enforce the specific rules in the parser. Firstly we ensure that a function is always declared in column 0. This makes for a fine structure but might need to be changed in the future if we allow for nested function declarations. we will then consume the unnecessary garbage. A function will then either be a Main function or a pure function, if we encounter a main we will then parse the function calls. Here we enforce another indentation rule. A function call, must reside directly under the function name of main (which is ``main''), like in the example code in Figure\textasciitilde{}\ref{flip}. In the parsing we do not enforce a single main function, instead, we handle this in the pre-processing.
If we however encounter a non-main function (from here just function) we will parse its rules. Like in the main function we ensure that a rule (other than the first, which must be on the same line) resides under the function name. that is the guard | must be placed here. Other than this indentation handling, the parser is simply a sequence of parsers and combinators.
\subsubsection{Rules}
\label{sec:org823f1f2}
The parsing for the Rule sum type is in itself quite simple as most of the indentation is handled in the function parser. Although the rule parser also will have to do some indentation enforcement, it will pass on its indentation level for the let-declarations parser, to make certain that let definitions is deeper indented than the rule, along with forcing let declarations to be lined up with the resulting pattern. Again this is simply used to establish a structure for the body of a particular function pattern, also called a rule.
\subsubsection{Let declarations}
\label{sec:orgc027d6f}
Unsurprisingly the let declaration follows a similar structure as the other parsers. overall we can reduce a let declaration to either of two, it is a function call/uncall or it is a loop. These are very similar in structure so we will only go over the simple case for function calls. again we ensure the indentation is correct, throwing a parse error otherwise. we then use the same strategy as we did for function calls in main to distinguish between a call and an uncall using the observing function. depending on whether the symbol ! is present before the function identifier, we get a \texttt{Left} or a \texttt{Right} value which we then convert to the appropriate type.
This function has a lot of duplicate code, as the loop/unloop construct is very similar. This could potentially be eliminated.
\subsubsection{Patterns}
\label{sec:org88a8fac}
Patterns are the most atomic part of the grammar, as its only non-terminal symbol is that of Pattern. It is thus also the easiest to parse. We construct a parser for each terminal and combine these using the parser combinators.
We can see that whenever we encounter a \texttt{[[]]} we have a \texttt{NilNil} constructor. for integer constants we simply wrap the constant value in the Const constructor, we, however, omit to change the value to its internal representation in RIL which would be 2n+1. The reason for this is that we want to distinguish between the syntactical and semantical meaning of the program. It is further noticeable that we also wrap \texttt{nil} as a Const with a value of 2.
A variable is simply the identifier wrapped in our \texttt{Var} constructor.
A not equal pattern is likewise simply the identifier and a recursive pattern call. The same holds for the \texttt{as} constructor, however, the second part of an \texttt{as} can only be a pair. For \texttt{Pairs} we can see\ref{patternP} it makes use of the MakeExprParser which specifies associativity and precedence for the two ways of constructing pairs.
Lastly, we also want to allow to wrap any \texttt{Pattern} in parenthesis.
\section{Semantics}
\label{sec:org8b98fcb}
\subsection{RIL}
\label{sec:orgffae8b3}
Before we explain the semantics of ARL, we will shortly go over RIL. At its core, RIL is a set of blocks consisting of an Entry, a Body, and an Exit. Both entries and exits are one of 3 constructs, either a conditional entry/jump, an unconditional entry/jump, or a subroutine entry/exit. These works fairly similar to regular jumps and labels, known from other languages. The biggest difference is the conditional entry, which is not present in those languages. It is the inverse of the conditional jump and is used when run in reverse. It is worth noting, that since RIL has such a basic structure it is a parameterless language, meaning subroutines will use specific variables for their computation. The body of a block consists of statements or subroutine calls. Therefore any control-flow will be in its own block. However, when looking at RIL code this might not be immediately obvious. As RIL is reversible, the statements in a body are quite limited to the form L\textsubscript{1} cross = R\textsubscript{1} dot R\textsubscript{2}, or L\textsubscript{1} <-> L\textsubscript{2}. where L is a variable or a memory location and R is either an L or an integer constant in the range -1\textsuperscript{31}-2\textsuperscript{31}-1, with some restrictions to which L value R can take. The reason for this that loss of information cannot be as the statement would be non-invertible. The swap likewise swaps the value of the two L's, ensuring no loss of information. the following table shows how each RIL instruction inverts, which will be useful as a reference for evaluating patterns in reverse.
