report/report.tex
\subsubsection{Value representation}
\label{sec:orgaf9dd9b}
RIL furthermore has a different value representation than ARL. RIL is as mentioned an intermediate language, with a syntax of very simple instructions. It thus uses specific patterns of machine words for different values.
\begin{itemize}
\item 0 represents the absence of a value.
\item ARL's pairs are in RIL represented as a pointer to a 3-word block memory, where the first word is the reference count, the second and third word is the first and second part of the pair respectively. the RIL pointer is always represented as a multiple of 4. An instance of this is nilnil (\texttt{[[]]}), which simply is a pair of two empty lists, represented by 2, and is constructed by an initialize procedure looking as such:
\end{itemize}
insert code
\begin{itemize}
\item Integer constants n in ARL will be translated to \(2n+1\) in RIL since constants in RIL has to be an odd number. This ensures that constants and pairs don't get mixed up.
\item The last type of word in RIL is even numbers, whose value is not a multiple of 4.  In its current state, only one symbol (\textasciitilde{}[]\textasciitilde{}/nil) is present, which is represented as the value 2.
\end{itemize}
\subsubsection{Subroutines}
\label{sec:orgd3f0b1c}
RIL also has 3 subroutines, which are used by the heap manager to manage the reference counts of nodes along with ensuring maximal sharing. These are used for some of the more complicated patterns in ARL.
copy - is used to copy values, which is what allows us to use the same variable multiple times.
fields - is used in the ``as'' pattern.
cons - is used for pairs.
\subsubsection{Copy}
\label{sec:org473e38b}
the copy subroutine uses the variables copyP and copyQ. Copy assumes copyP to be bigger than 0 and copyQ to be equal to 0. This makes sense, since 0 is the absence of a value, and thus copyP cannot be 0 as there would be no value to copy and it must be a positive integer as it is an index in memory. CopyQ likewise needs to be 0 as would not be a true copy of copyP if it weren't. If copyP is a pointer the reference count is increased and copyQ is set to the same value as copyP using \texttt{copyQ += copyP}. Called in Reverse copy assumes the two variables to be equivalent, as this is the only way to ``destroy'' a variable without loss of information. This happens by subtracting copyP from copyQ. thus copyQ will be 0. again if copyP is a pointer the reference counter is decreased.
\subsubsection{Fields}
\label{sec:org7546fa2}
Fields have 3 variables, fieldsA, fieldsD, and fieldsP. We have previously described how an as pattern is an identifier and a pair. the identifier will be the pointer to this pair and will be located in the fieldsP variable. The other two variables must be 0, to ensure correctness. It will then set the fieldsA and fieldsD to the second and third word of the pair respectively, which corresponds to the car and cdr of the pair. In reverse, the fieldsA and fieldsD will be cleared.
\subsubsection{Cons}
\label{sec:org7c22514}
The cons subroutine is quite a bit more complex than the other two. This is because it also has to allocate and deallocate nodes and it is implemented using hashing to make lookup more efficient. We will not go over the specifics, but only the general functionality. Cons take two arguments consA and consD, which must be values (not 0). These values will be cleared, or possibly more intuitive they will be placed as second and third word of the pair, if the pair doesn't already exist on the heap, otherwise the reference count will be increased, while consA and consD are cleared. The pointer to the pair (consA, consD) will be in consP. Called in reverse a pair is deconstructed, deallocating the pointer if the reference count reaches 0 and increasing the reference count for the consA and consD fields.
\subsection{Functions and Rules}
\label{sec:orgadc53c6}
\begin{figure}[!htb]
\begin{minipage}{0.4\textwidth}
\begin{lstlisting}
$F\llb f\; r_1 | \cdots | r_n \rrb =$
    begin f
    skip
    --> f$_1$
    f$_1'$ <--
    skip
    end f
    $R \llb r_1 \rrb$
    $\vdots$
    $R \llb r_n \rrb$
    f$_{n+1}$ <--
    assert A != A
    --> f$_{n+1}'$
\end{lstlisting}
\end{minipage}
\qquad
\begin{minipage}{0.4\textwidth}
\begin{lstlisting}
$R\llb p_i = d_i^1 \cdots d_i^n o_i \rrb =$
    f$_i$ <--
    $ P \llb p_i \rrb A$
    A != 0 --> f$_i+1$
    $ D \llb d_{i}^1 \rrb$
    $ \vdots$
    $ D \llb d_{i}^n \rrb$
    f$_{i+1}'$ <-- A != 0;
    $\overline{P \llb o_i \rrb A}$
    --> f$_i'$
\end{lstlisting}
\end{minipage}

\caption{Semantics of functions and rules}
\label{rules}
\end{figure}

Figure\textasciitilde{}\ref{rules} show how we evaluate functions and rules, where \(R \llb r_i \rrb\) is the translation of the Rules and \(f_i\) and  \(f_i'\) represent entry points and exit points respectively. Essentially a function will have its entry point, and jump immediately to the entry of the first rule. It will evaluate each rule sequentially until one is evaluated correctly, that is, its exit point has been reached it will then terminate the function/subroutine (this is a simplification). If no rules are matched the function will assert a false statement, thus exiting with a failure, which essentially means a function cannot be called on any construct only those matching the rules.

Rules are introduced by their entry point f\textsubscript{i}. From here p\textsubscript{i}, which is the parameter pattern of the rule will be evaluated. Essentially what we do when we evaluate a pattern in the forward direction we try to move it out of A, which is the variable chosen for input and output as RIL as stated is parameterless. If A is correctly distributed to p\textsubscript{i}, the value of A will be 0 and we can thus ignore the conditional jump. and proceed to evaluate the body of the rule. Is A however not equal to 0, it means that the pattern was not correctly matched and thus we want to make the jump, which leads us to the next rule. If the jump is not taken the body can safely be evaluated. We can then see there is an exit point for f'\textsubscript{i+1}. The reason for this is we have to evaluate the result of each previous rule to make sure the output is disjoint, meaning the function is injective. It is also worth noting that when evaluating the result o\textsubscript{i}, we evaluate it inversely. This can be seen as a construction of A based on o\textsubscript{i}, whereas the \(P\llb p_i \rrb A\) could be the deconstruction of A into p\textsubscript{i}. Lastly, we will take an unconditional jump to right before the result in the previous rule, to do the disjoint checking as described.
