report/report.tex

\subsection{Patterns}
\label{sec:org62f0b75}
\subsubsection{Variables}
\label{sec:org5ff9d66}
\begin{figure}[!htb]
\begin{minipage}{0.4\textwidth}
\begin{lstlisting}
$P\llb x \rrb v =$
   x <-> v
\end{lstlisting}
when x is first occurence
\begin{lstlisting}
$P\llb x \rrb v =$
   v != x --> l$_1$;
   v <-> copyQ;
   x <-> copyP;
   uncall copy;
   x <-> copyP;
   l$_1$ <-- v != 0;
\end{lstlisting}
\end{minipage}
\qquad
\begin{minipage}{0.4\textwidth}
\begin{lstlisting}
$\overline{P\llb x \rrb v} =$
   x <-> v
\end{lstlisting}
when x is first occurence
\begin{lstlisting}
$\overline{P\llb x \rrb v} =$
   v != 0 --> l$_1$;
   x <-> copyP;
   call copy;
   x <-> copyP;
   v <-> copyQ;
   l$_1$ <-- v != x;
\end{lstlisting}
\end{minipage}

\caption{Semantics of variables}
\label{variables}
\end{figure}
There are two different ways a variable needs to be compiled. The most basic rule \texttt{x <-> v}, with x being the variable, will be valid whenever x first occurs in a pattern. Called in reverse this is simply the same instruction. For every occurrence of x that is not the first occurrence, we will need to use the copy subroutine, described earlier. When evaluating a variable that has occurred previously we first need to check whether or not x and v are identical. This is a prerequisite for the copy subroutine to work as it results in an assertion failure in the copy subroutine otherwise. we then switch the values into the variables that are used in the routine. we switch v into copyQ as this is the value that will be consumed. x will be switched into copyP as this is the value that will be saved. When evaluated in reverse, we check that v is 0 as this again would result in an assertion failure, we move x into copyP and makes a copy into copyQ and move it back to x and v.

\subsubsection{Constants}
\label{sec:org4edb57e}
\begin{figure}[!htb]
\begin{minipage}{0.4\textwidth}
\begin{lstlisting}
$P \llb k \rrb v =$
    v != k --> l$_1$;
    v -= k;
    l$_1$ <-- v != 0;
\end{lstlisting}
\end{minipage}
\qquad
\begin{minipage}{0.4\textwidth}
\begin{lstlisting}
$\overline{P\llb k \rrb v} =$
    v != 0 --> l$_1$;
    v += k;
    l$_1$ <-- v != x;
\end{lstlisting}
\end{minipage}

\caption{Semantics of constants}
\label{constants}
\end{figure}
Constants are quite simple. firstly the constant need to be equivalent to v for the pattern to match. Once again this we want to extract the constant k from v, getting v to equal 0 if the pattern matches. This can only be the case when they are equivalent. In the case they are, we simply subtract k from v, and since k is a constant and will never change we cannot and there is no need to do anything to k. In reverse we do the opposite we check if v is 0 if it is we can set it to the value of k.

\subsubsection{Pairs}
\label{sec:orge75efa8}
\begin{figure}[!htb]
\begin{minipage}{0.4\textwidth}
\begin{lstlisting}
$P\llb (p_1,p_2) \rrb v =$
   v & 3 --> l$_1$;
   v <-> consP;
   uncall cons;
   $t_1$ <-> consA;
   $t_2$ <-> consD;
   $P \llb p_1 \rrb t_1$;
   t$_1$ != 0 --> l$_2$;
   $P \llb p_2 \rrb t_2$;
   t$_2$ == 0 --> l$_3$;
   l$_2$ <-- t$_1$ != 0;
   $\overline{P \llb p_1 \rrb t_1}$;
   $t_1$ <-> consA;
   $t_2$ <-> consD;
   call cons;
   v <-> consP;
   l$_3$ <-- v == 0;
   l$_1$ <-- v & 3;
\end{lstlisting}
\end{minipage}
\qquad
\begin{minipage}{0.4\textwidth}
\begin{lstlisting}
$\overline{P\llb (p_1,p_2) \rrb v} =$
   v & 3 --> l$_1$;
   v == 0 -> l$_3$;
   v <-> consP;
   uncall cons;
   $t_1$ <-> consA;
   $t_2$ <-> consD;
   $P \llb p_1 \rrb t_1$;
   t$_1$ != 0 --> l$_2$;
   l$_3$ <-- t$_2$ == 0;
   $\overline{P \llb p_2 \rrb t_2}$;
   l$_2$ <-- t$_1$ != 0;
   $\overline{P \llb p_1 \rrb t_1}$;
   $t_1$ <-> consA;
   $t_2$ <-> consD;
   call cons;
   v <-> consP;
   l$_1$ <-- v & 3;
\end{lstlisting}
\end{minipage}

\caption{Semantics of pairs}
\label{pairs}
\end{figure}
When translating a pair to RIL, we first start by checking whether or not v is a pointer to a pair. This can be done by checking \texttt{v \& 3}, as pointers always will have 11 in their 2 least significant bits. If v simply is not a pair, we can skip the entire unfolding of v, jumping straight to the bottom. is v however a pair, we move v into consP, as we need to deconstruct by uncalling cons. the car and cdr will then be in consA and consD. we however have to move these to two newly created variables t\textsubscript{1} and t\textsubscript{2}. this might seems unnecessary at first but whenever we have nested patterns, not moving consA and consD out to new variables will make the program fail as these will not be 0 in the uncall to cons in the nested pair. when moved accordingly, we can then evaluate p\textsubscript{1} under t\textsubscript{1}. After this evaluation we need to check if \texttt{v} was correctly cleared. If t\textsubscript{1} is 0 we can move on to evaluate p\textsubscript{2} under t\textsubscript{2}. Is it the case that t\textsubscript{1} is not 0 we jump to entry l\textsubscript{3} and reconstruct v\textsubscript{1}. Once again this is to ensure we don't lose any information while evaluating a pattern we will then proceed to reconstruct v by doing the inverse sequence of operations as when we deconstructed the pair. Do we on the other hand evaluate p\textsubscript{2} correctly we can jump to entry l\textsubscript{4}. When evaluated inversely we start by checking whether v is a pointer, skipping the entire thing if it isn't. we then check wether v is 0. if it is we jump to entry l\textsubscript{4}, and proceed to construct v by evaluating t\textsubscript{2} and t\textsubscript{1} inversely, calling cons and moving into v. If v is not 0 we have to deconstruct it even further, by uncalling cons and make evaluate t\textsubscript{1}. Overall the procedure will deconstruct a pair in forward direction and create a pair in the inverse direction.
\subsubsection{As pattern}
\label{sec:org541e4e6}
\begin{figure}[!htb]
\begin{minipage}{0.4\textwidth}
\begin{lstlisting}
$P \llb x \uptext{as} (p_1,p_2) \rrb v =$
   v & 3 --> l$_1$;
   v <-> fieldsP;
   call fields;
   x <-> fieldsP;
   $t_1$ <-> fieldsA;
   $t_2$ <-> fieldsD;
   $P \llb p_1 \rrb t_1$;
   t$_1$ != 0 --> l$_2$;
   $P \llb p_2 \rrb t_2$;
   t$_2$ == 0 --> l$_3$;
   l$_2$ <-- t$_1$ != 0;
   $\overline{P \llb p_1 \rrb consA}$;
   x <-> fieldsP;
   $t_1$ <-> fieldsA;
   $t_2$ <-> fieldsD;
   uncall fields;
   v <-> fieldsP;
   l$_3$ <-- v == 0;
   l$_1$ <-- v & 3;
\end{lstlisting}
\end{minipage}
\qquad
\begin{minipage}{0.4\textwidth}
\begin{lstlisting}
$\overline{P \llb x \uptext{as} (p_1,p_2) \rrb v} =$
   v & 3 --> l$_1$;
   v == 0 -> l$_3$;
   v <-> fieldsP;
   call fields;
   x <-> fieldsP;
   $t_1$ <-> fieldsA;
   $t_2$ <-> fieldsD;
   $P \llb p_1 \rrb t_1$;
   t$_1$ != 0 --> l$_2$;
   l$_3$ <-- t$_2$ == 0;
   $\overline{P \llb p_2 \rrb t_2}$;
   l$_2$ <-- t$_1$ != 0;
   $\overline{P \llb p_1 \rrb t_1}$;
   x <-> fieldsP;
   $t_1$ <-> fieldsA;
   $t_2$ <-> fieldsD;
   uncall fields;
   v <-> fieldsP;
   l$_1$ <-- v & 3;
\end{lstlisting}
\end{minipage}

\caption{Semantics of As pattern}
\label{As}
\end{figure}
An \texttt{as} pattern is almost identical to the pairs, the only difference is that we want to keep the integrity of x, which is done by using the fields sub-routine. Just like with a pair, we check if v is in fact a pair. we will then move v into fieldsP, calling \texttt{fields} and then distributing the pointer to x, fieldsA to t\textsubscript{1} and fieldD to t2. Again t\textsubscript{1} and t\textsubscript{2} needs to be unique newly created variables, such that we encounter any trouble with nested patterns. The rests of the evaluation of an \texttt{as} pattern is the same as for pairs, since the only difference between an \texttt{as} pattern and a \texttt{pair} pattern is that we in the \texttt{as} pattern want to keep a reference to the pair.  In reverse the same principles also holds.
