report/report.org
*** Not equal (<>)
#+BEGIN_EXPORT latex
\begin{figure}[!htb]
\begin{minipage}{0.4\textwidth}
\begin{lstlisting}
$P \llb x \neq p \rrb v =$
    assert x == 0;
    $P \llb p \rrb v$
    x += v;
    $\overline{P \llb p \rrb v}$
    v -= x
\end{lstlisting}
\end{minipage}
\qquad
\begin{minipage}{0.4\textwidth}
\begin{lstlisting}
$\overline{P \llb x \neq p \rrb v} =$
    v += x
    $P \llb p \rrb v$
    x -= v;
    $\overline{P \llb p \rrb v}$
    assert x == 0;
\end{lstlisting}
\end{minipage}

\caption{Semantics of <> pattern}
\label{Neq}
\end{figure}
#+END_EXPORT

For a ~not equal~ pattern, we first need to assume x is 0 otherwise our two updates, first to x then to v, would compromise the integrity of v. For instance in the case of flip the rule ~| x = x~ could be written as ~| x <> (l,r) = x <> (fr,fl)~. In such a case v would not be a pointer (v !& 3), thus we skip the entire evaluation of p. we would then subtract, v from x, do nothing once again, and then subtract a value larger than v from v, which is nonsensical. Therefore x must be 0 before the evaluation. As explained, after the assertion we want to deconstruct p under v, then update x with ~x += v~, setting x to v. here v should have its original value as it should skip moving v into p, else x would be equal to p. we then reconstruct p under v and subtract the value of x from v. In its core this is a simple swap, however, if p matches v, v should be 0 and no update to x is happening.

** Let definitions
#+BEGIN_EXPORT latex
\begin{figure}[!htb]
\begin{minipage}{0.4\textwidth}
\begin{lstlisting}
$D \llb \textup{let} p_1 = \textup{call} f p_2 \textup{in} \rrb =$
    $\overline{P \llb p_2 \rrb A}$
    call f;
    $P \llb p_2 \rrb A$
    assert A == 0;
\end{lstlisting}
\end{minipage}
\qquad
\begin{minipage}{0.4\textwidth}
\begin{lstlisting}
$D \llb \textup{let} p_1 = \textup{loop} f p_2 \textup{in} \rrb =$
    l$_1$ <-- A != 0;
    $\overline{P \llb p_2 \rrb A}$
    $P \llb p_1 \rrb A$
    A == 0 --> l$_2$;
    uncall f
    --> l$_1$
    l$_2$ <--
    assert x == 0;
\end{lstlisting}
\end{minipage}

\caption{Semantics of let definitions}
\label{defs}
\end{figure}
#+END_EXPORT
*** function calls
A call consists of 4 parts. First, we want to evaluate p_2 under A in inverse. We want to construct A from p_2. this should prepare A to be the input for ~f~. the call to ~f~ then happens, and the result is always placed in A. we then evaluate p_1 under A, moving the value from A into p_1. lastly, we need to assert that A is 0. this assertion is important, as it ensures us that the result of ~f~ is in fact a matching pattern to p_1. For instance, if ~f~ returns 7, we cannot assign 7 to a pair, thus such a construct should fail.
*** Loops
Loops are useful in situations where tail-recursive functions are needed. but since these are not allowed we can write these as our loop construct. The loop will keep calling ~f~ until p_1 is matched. we first have an entry l_1. This is where the loop starts. we then construct A from p_2. Then right after we deconstruct A into p_1. if A is 0 it means p_1 was matched correctly and we do not call the function ~f~ as we jump to entry l_2. if A is not 0 p_1 is not matched and we call the function ~f~. We then jump back to l_1, repeating the procedure until p_1 is matched.* Evaluation

* Compiler implementation
The implementation of the evaluation functions for ARL is built on a stack of monad-transformers. The reason for choosing such a solution is that monads are a well-integrated part of Haskell and it makes it a lot easier to implement the recursive calls to the different functions as we can use do notation to lift our functions into the monad. Furthermore, we both have an environment we want to pass on to the different ~eval~-functions and some states to make it a lot easier to ensure that entries and exits are unique and that variables are correct etc. And probably most importantly, the stack allows for easy extensibility as we can easily add new monad transformers to our stack. The stack looks as follows:

#+BEGIN_SRC haskell
type Eval a = ReaderT Env (StateT RilState Identity) a

runEval env st ev = runIdentity $ runStateT (runReaderT ev env) st
#+END_SRC

As can be seen from Figure~\ref{}, the stack is fairly simple. The eval type takes an arbitrary type a, we only use ~String~ as this allows us to write the RIL code directly to a file. our string is then wrapped in an identity monad, this in itself is useless, but works well with other monads. This again is better for extensibility as, we can always substitute for another monad such as IO, which cannot be stacked as a transformer. The identity monad is then wrapped in a state transformer, where the state itself is of the type ~RilState~, which is a product type we will go over later in this section. And lastly, we wrap readerT around the State. In the future, it could be useful to add the error monad to the stack to handle failures, which we currently don't do, or the writer monad to add some kind of logging.

** Why reader?
 The reader monad is extremely useful in our case as we have an environment we want to pass around to the different function, and it makes it easier to manage if this is not passed around as parameters but is kept isolated in the environment which can then be locally set to the specific function calls. From section~\ref{} it might be clear that we often use ~A~ as the variable, we evaluate under, however in some cases this change, for instance when evaluating a pair where we need to evaluate t_1 and t_2. Therefore we might want to keep track of this. This at first seems like a state but since it never changes inside of any function we can define it in the environment. The second part of the environment is a map. We use this to keep track of which variables are alive in the program. These should be stored on the stack before a function call. this is fairly simple to do since the control flow of ARL is extremely simple. One solution might be to search the AST from the bottom up, however since the control-flow is as simple as it is, we extract all variable IDs from a Rule into a list of ID lists. we then check if a variable in a list is in any of the following lists. If this is the case the variable must be alive. we can then zip these results with the unique identifier for a let declaration, constructing our map. Thus the Environment looks as follows:
#+BEGIN_SRC haskell
   type Env = (String, M.Map String [ID])

   baseEnv = ("A", M.empty)
#+END_SRC
