report/report.tex

\subsubsection{Not equal (<>)}
\label{sec:orgce7aec1}
\begin{figure}[!htb]
\begin{minipage}{0.4\textwidth}
\begin{lstlisting}
$P \llb x \neq p \rrb v =$
    assert x == 0;
    $P \llb p \rrb v$
    x += v;
    $\overline{P \llb p \rrb v}$
    v -= x
\end{lstlisting}
\end{minipage}
\qquad
\begin{minipage}{0.4\textwidth}
\begin{lstlisting}
$\overline{P \llb x \neq p \rrb v} =$
    v += x
    $P \llb p \rrb v$
    x -= v;
    $\overline{P \llb p \rrb v}$
    assert x == 0;
\end{lstlisting}
\end{minipage}

\caption{Semantics of <> pattern}
\label{Neq}
\end{figure}

For a \texttt{not equal} pattern, we first need to assume x is 0 otherwise our two updates, first to x then to v, would compromise the integrity of v. For instance in the case of flip the rule \texttt{| x = x} could be written as \texttt{| x <> (l,r) = x <> (fr,fl)}. In such a case v would not be a pointer (v !\& 3), thus we skip the entire evaluation of p. we would then subtract, v from x, do nothing once again, and then subtract a value larger than v from v, which is nonsensical. Therefore x must be 0 before the evaluation. As explained, after the assertion we want to deconstruct p under v, then update x with \texttt{x += v}, setting x to v. here v should have its original value as it should skip moving v into p, else x would be equal to p. we then reconstruct p under v and subtract the value of x from v. In its core this is a simple swap, however, if p matches v, v should be 0 and no update to x is happening.

\subsection{Let definitions}
\label{sec:org2642d81}
\begin{figure}[!htb]
\begin{minipage}{0.4\textwidth}
\begin{lstlisting}
$D \llb \textup{let} p_1 = \textup{call} f p_2 \textup{in} \rrb =$
    $\overline{P \llb p_2 \rrb A}$
    call f;
    $P \llb p_2 \rrb A$
    assert A == 0;
\end{lstlisting}
\end{minipage}
\qquad
\begin{minipage}{0.4\textwidth}
\begin{lstlisting}
$D \llb \textup{let} p_1 = \textup{loop} f p_2 \textup{in} \rrb =$
    l$_1$ <-- A != 0;
    $\overline{P \llb p_2 \rrb A}$
    $P \llb p_1 \rrb A$
    A == 0 --> l$_2$;
    uncall f
    --> l$_1$
    l$_2$ <--
    assert x == 0;
\end{lstlisting}
\end{minipage}

\caption{Semantics of let definitions}
\label{defs}
\end{figure}
\subsubsection{function calls}
\label{sec:org951b0ba}
A call consists of 4 parts. First, we want to evaluate p\textsubscript{2} under A in inverse. We want to construct A from p\textsubscript{2}. this should prepare A to be the input for \texttt{f}. the call to \texttt{f} then happens, and the result is always placed in A. we then evaluate p\textsubscript{1} under A, moving the value from A into p\textsubscript{1}. lastly, we need to assert that A is 0. this assertion is important, as it ensures us that the result of \texttt{f} is in fact a matching pattern to p\textsubscript{1}. For instance, if \texttt{f} returns 7, we cannot assign 7 to a pair, thus such a construct should fail.
\subsubsection{Loops}
\label{sec:orgd219309}
Loops are useful in situations where tail-recursive functions are needed. but since these are not allowed we can write these as our loop construct. The loop will keep calling \texttt{f} until p\textsubscript{1} is matched. we first have an entry l\textsubscript{1}. This is where the loop starts. we then construct A from p\textsubscript{2}. Then right after we deconstruct A into p\textsubscript{1}. if A is 0 it means p\textsubscript{1} was matched correctly and we do not call the function \texttt{f} as we jump to entry l\textsubscript{2}. if A is not 0 p\textsubscript{1} is not matched and we call the function \texttt{f}. We then jump back to l\textsubscript{1}, repeating the procedure until p\textsubscript{1} is matched.* Evaluation

\section{Compiler implementation}
\label{sec:orgaeb9201}
The implementation of the evaluation functions for ARL is built on a stack of monad-transformers. The reason for choosing such a solution is that monads are a well-integrated part of Haskell and it makes it a lot easier to implement the recursive calls to the different functions as we can use do notation to lift our functions into the monad. Furthermore, we both have an environment we want to pass on to the different \texttt{eval}-functions and some states to make it a lot easier to ensure that entries and exits are unique and that variables are correct etc. And probably most importantly, the stack allows for easy extensibility as we can easily add new monad transformers to our stack. The stack looks as follows:

\begin{verbatim}
type Eval a = ReaderT Env (StateT RilState Identity) a

runEval env st ev = runIdentity $ runStateT (runReaderT ev env) st
\end{verbatim}

As can be seen from Figure\textasciitilde{}\ref{}, the stack is fairly simple. The eval type takes an arbitrary type a, we only use \texttt{String} as this allows us to write the RIL code directly to a file. our string is then wrapped in an identity monad, this in itself is useless, but works well with other monads. This again is better for extensibility as, we can always substitute for another monad such as IO, which cannot be stacked as a transformer. The identity monad is then wrapped in a state transformer, where the state itself is of the type \texttt{RilState}, which is a product type we will go over later in this section. And lastly, we wrap readerT around the State. In the future, it could be useful to add the error monad to the stack to handle failures, which we currently don't do, or the writer monad to add some kind of logging.

\subsection{Why reader?}
\label{sec:org763fa06}
The reader monad is extremely useful in our case as we have an environment we want to pass around to the different function, and it makes it easier to manage if this is not passed around as parameters but is kept isolated in the environment which can then be locally set to the specific function calls. From section\textasciitilde{}\ref{} it might be clear that we often use \texttt{A} as the variable, we evaluate under, however in some cases this change, for instance when evaluating a pair where we need to evaluate t\textsubscript{1} and t\textsubscript{2}. Therefore we might want to keep track of this. This at first seems like a state but since it never changes inside of any function we can define it in the environment. The second part of the environment is a map. We use this to keep track of which variables are alive in the program. These should be stored on the stack before a function call. this is fairly simple to do since the control flow of ARL is extremely simple. One solution might be to search the AST from the bottom up, however since the control-flow is as simple as it is, we extract all variable IDs from a Rule into a list of ID lists. we then check if a variable in a list is in any of the following lists. If this is the case the variable must be alive. we can then zip these results with the unique identifier for a let declaration, constructing our map. Thus the Environment looks as follows:
\begin{verbatim}
   type Env = (String, M.Map String [ID])

   baseEnv = ("A", M.empty)
\end{verbatim}
